DangerousPrototypes/dangerous-prototypes-open-hardware/trunk/Logic_Pirate/AN1388_Source_Code_V2012_10_05/PIC32_Bootloaders/PC Application/PIC32UBL/PIC32UBLDlg.cpp
// PIC32UBLDlg.cpp : implementation file
//

#include "stdafx.h"
#include "ComPort.h"
#include "Ethernet.h"
#include "USB_HID.h"
#include "Hex.h"
#include "BootLoader.h"
#include "PIC32UBL.h"
#include "PIC32UBLDlg.h"
#include ".\pic32ubldlg.h"
#include <windows.h>
#include <wtypes.h>
#include <dbt.h>


#ifdef _DEBUG
#define new DEBUG_NEW
#endif

#define BOOTLOADER_ROUTINE_TIMER 1
#define BOOTLOADER_GUI_UPDATE_TIMER 2
#define SWAP(x)   ( ((x<<24)&(0xFF000000)) | ((x<<8)&(0x00FF0000))  | ((x>>24)&(0x000000FF)) | ((x>>8)&(0x0000FF00)) )

#define SAVE 1
#define RESTORE 2

#define SaveButtonStatus() ButtonStatus(SAVE)
#define RestoreButtonStatus() ButtonStatus(RESTORE)

// CAboutDlg dialog used for App About

class CAboutDlg : public CDialog
{
public:
	CAboutDlg();

// Dialog Data
	enum { IDD = IDD_ABOUTBOX };

	protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV support

// Implementation
protected:
	DECLARE_MESSAGE_MAP()
};

CAboutDlg::CAboutDlg() : CDialog(CAboutDlg::IDD)
{
}

void CAboutDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
}

BEGIN_MESSAGE_MAP(CAboutDlg, CDialog)
END_MESSAGE_MAP()


// CPIC32UBLDlg dialog



CPIC32UBLDlg::CPIC32UBLDlg(CWnd* pParent /*=NULL*/)
	: CDialog(CPIC32UBLDlg::IDD, pParent)
	, cstringEditConsole(_T(""))
	, uLongEditBoxVID(0)
	, uLongEditBoxPID(0)
	, boolRadioEnableCom(false)
	, boolRadioEnableUSB(false)
	, boolCheckComEnable(FALSE)
	, boolCheckUsbEnable(FALSE)
	, stringEditBoxUSBVID(_T(""))
	, stringEditBoxUSBPID(_T(""))
	, boolCheckEthEnable(FALSE)
	, ip_value(0)
	, valEditBoxSocket(0)
{
	m_hIcon = AfxGetApp()->LoadIcon(IDR_MAINFRAME);
}

void CPIC32UBLDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_COMBO_COMPORT, ctrlComboBoxComPort);
	DDX_Control(pDX, IDC_COMBO_BAUDRATE, ctrlComboBoxBaudRate);
	DDX_Control(pDX, IDC_BUTTON_PROGRAM, ctrlButtonProgram);
	DDX_Control(pDX, IDC_BUTTON_LOADHEX, ctrlButtonLoadHex);
	DDX_Control(pDX, IDC_BUTTON_ERASE, ctrlButtonErase);
	DDX_Control(pDX, IDC_BUTTON_VERIFY, ctrlButtonVerify);
	DDX_Control(pDX, IDC_BUTTON_RUNAPPLICATION, ctrlButtonRunApplication);
	DDX_Control(pDX, IDC_EDIT_CONSOLE, ctrlEditConsole);
	DDX_Text(pDX, IDC_EDIT_CONSOLE, cstringEditConsole);
	DDX_Control(pDX, IDC_PROGRESS_BAR, ctrlProgressBar);
	DDX_Control(pDX, IDC_BUTTON_CONNECT, ctrlButtonConnectDevice);
	DDX_Control(pDX, IDC_BUTTON_ERASE_PROG_VERIFY, ctrlButtonEraseProgVerify);
	DDX_Control(pDX, IDC_BUTTON_BOOT_VER, ctrlButtonBootloaderVer);
	DDX_Check(pDX, IDC_CHECK_COM_ENABLE, boolCheckComEnable);
	DDX_Check(pDX, IDC_CHECK_USB_ENABLE, boolCheckUsbEnable);
	DDX_Control(pDX, IDC_CHECK_COM_ENABLE, ctrlCheckBoxComEnable);
	DDX_Control(pDX, IDC_CHECK_USB_ENABLE, ctrlCheckBoxUSBEnable);
	DDX_Control(pDX, IDC_EDIT_USB_VID, ctrlEditBoxUSBVID);
	DDX_Control(pDX, IDC_EDIT_USB_PID, ctrlEditBoxUSBPID);
	DDX_Text(pDX, IDC_EDIT_USB_VID, stringEditBoxUSBVID);
	DDX_Text(pDX, IDC_EDIT_USB_PID, stringEditBoxUSBPID);
	DDX_Control(pDX, IDC_CHECK_ETH_ENABLE, ctrlCheckBoxEthEnable);
	DDX_Check(pDX, IDC_CHECK_ETH_ENABLE, boolCheckEthEnable);
	DDX_IPAddress(pDX, IDC_IP_ADDRESS, ip_value);
	DDX_Text(pDX, IDC_SOCKET, valEditBoxSocket);
	DDX_Control(pDX, IDC_IP_ADDRESS, ctrlEditBoxIPaddress);
	DDX_Control(pDX, IDC_SOCKET, ctrlEditBoxSocketaddress);
}

BEGIN_MESSAGE_MAP(CPIC32UBLDlg, CDialog)
	ON_WM_SYSCOMMAND()
	ON_WM_PAINT()
	ON_WM_QUERYDRAGICON()
	//}}AFX_MSG_MAP
	ON_BN_CLICKED(IDCANCEL, OnBnClickedCancel)
	ON_BN_CLICKED(IDC_BUTTON_CONNECT, OnBnClickedButtonConnect)
	ON_WM_TIMER()
	ON_BN_CLICKED(IDC_BUTTON_ERASE, OnBnClickedButtonErase)
	ON_BN_CLICKED(IDC_BUTTON_LOADHEX, OnBnClickedButtonLoadhex)
	ON_MESSAGE(WM_USER_BOOTLOADER_RESP_OK, OnReceiveResponse)
	ON_MESSAGE(WM_USER_BOOTLOADER_NO_RESP, OnTransmitFailure)
	ON_BN_CLICKED(IDC_BUTTON_PROGRAM, OnBnClickedButtonProgram)
	ON_BN_CLICKED(IDC_BUTTON_VERIFY, OnBnClickedButtonVerify)
	ON_BN_CLICKED(IDC_BUTTON_ERASE_PROG_VERIFY, OnBnClickedButtonEraseProgVerify)
	ON_BN_CLICKED(IDC_BUTTON_RUNAPPLICATION, OnBnClickedButtonRunapplication)
	ON_BN_CLICKED(IDC_BUTTON_BOOT_VER, OnBnClickedButtonBootVer)
	
	ON_BN_CLICKED(IDC_CHECK_COM_ENABLE, OnBnClickedCheckComEnable)
	ON_BN_CLICKED(IDC_CHECK_USB_ENABLE, OnBnClickedCheckUsbEnable)
	ON_BN_CLICKED(IDC_CHECK_ETH_ENABLE, OnBnClickedCheckEthEnable)
	ON_WM_DEVICECHANGE()
	ON_WM_DEVMODECHANGE()
END_MESSAGE_MAP()


// CPIC32UBLDlg message handlers

BOOL CPIC32UBLDlg::OnInitDialog()
{
	CDialog::OnInitDialog();

	// Add "About..." menu item to system menu.

	// IDM_ABOUTBOX must be in the system command range.
	ASSERT((IDM_ABOUTBOX & 0xFFF0) == IDM_ABOUTBOX);
	ASSERT(IDM_ABOUTBOX < 0xF000);

	CMenu* pSysMenu = GetSystemMenu(FALSE);
	if (pSysMenu != NULL)
	{
		CString strAboutMenu;
		strAboutMenu.LoadString(IDS_ABOUTBOX);
		if (!strAboutMenu.IsEmpty())
		{
			pSysMenu->AppendMenu(MF_SEPARATOR);
			pSysMenu->AppendMenu(MF_STRING, IDM_ABOUTBOX, strAboutMenu);
		}
	}

	// Set the icon for this dialog.  The framework does this automatically
	//  when the application's main window is not a dialog
	SetIcon(m_hIcon, TRUE);			// Set big icon
	SetIcon(m_hIcon, FALSE);		// Set small icon

	// TODO: Add extra initialization here
	ExtraInitialization();


	
	return TRUE;  // return TRUE  unless you set the focus to a control
}

void CPIC32UBLDlg::OnSysCommand(UINT nID, LPARAM lParam)
{
	if ((nID & 0xFFF0) == IDM_ABOUTBOX)
	{
		CAboutDlg dlgAbout;
		dlgAbout.DoModal();
	}
	else
	{
		CDialog::OnSysCommand(nID, lParam);
	}
}

// If you add a minimize button to your dialog, you will need the code below
//  to draw the icon.  For MFC applications using the document/view model,
//  this is automatically done for you by the framework.

void CPIC32UBLDlg::OnPaint() 
{
	if (IsIconic())
	{
		CPaintDC dc(this); // device context for painting

		SendMessage(WM_ICONERASEBKGND, reinterpret_cast<WPARAM>(dc.GetSafeHdc()), 0);

