DangerousPrototypes/dangerous-prototypes-open-hardware/trunk/Logic_Pirate/AN1388_Source_Code_V2012_10_05/PIC32_Bootloaders/PC Application/PIC32UBL/PIC32UBLDlg.cpp
		// Center icon in client rectangle
		int cxIcon = GetSystemMetrics(SM_CXICON);
		int cyIcon = GetSystemMetrics(SM_CYICON);
		CRect rect;
		GetClientRect(&rect);
		int x = (rect.Width() - cxIcon + 1) / 2;
		int y = (rect.Height() - cyIcon + 1) / 2;

		// Draw the icon
		dc.DrawIcon(x, y, m_hIcon);
	}
	else
	{
		CDialog::OnPaint();
	}
}

// The system calls this function to obtain the cursor to display while the user drags
//  the minimized window.
HCURSOR CPIC32UBLDlg::OnQueryDragIcon()
{
	return static_cast<HCURSOR>(m_hIcon);
}

/****************************************************************************
 * Invoked just before dialog is closed
 *
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedCancel()
{
	int confirm;
	// TODO: Add your control notification handler code here
	confirm = MessageBox("Confirm Exit?", "Exit", MB_YESNO|MB_ICONQUESTION);
	if(confirm == 6)
	{
		// Exit confirmed
		OnCancel();
	}
}






//extern HDEVINFO SetupDiGetClassDevs(CONST GUID*, PCTSTR, HWND, DWORD);

/****************************************************************************
 * Invoked when connect button is clicked
 *
 *  
 *****************************************************************************/

void CPIC32UBLDlg::OnBnClickedButtonConnect()
{
	INT comport;
	INT baud;
	CString string;
	UINT vid;
	UINT pid;
	ULONG ip;
	USHORT skt;
	UpdateData(TRUE);
	
	if(ConnectionEstablished)
	{
		// Already connected. Disconnect now.
		ConnectionEstablished = false;

		// Shut down the rx-tx thread, if already opened.
			mBootLoader.ShutdownThread();
		
		if(mBootLoader.GetPortOpenStatus(PortSelected))
		{
			// com port already opened. close com port
			mBootLoader.ClosePort(PortSelected);			
		}

		

		// Print console.
		PrintKonsole("Device disconnected");
					
		EnableAllButtons(FALSE);
		

		ctrlButtonConnectDevice.SetWindowText("Connect");
		ctrlButtonConnectDevice.EnableWindow(TRUE);
	}
	else
	{
		// Establish new connection.
		comport = ctrlComboBoxComPort.GetCurSel();
		baud = ctrlComboBoxBaudRate.GetCurSel();

		sscanf(stringEditBoxUSBVID, "%X", &vid);
		sscanf(stringEditBoxUSBPID, "%X", &pid);
		// Update the screen with what VID and PID we have read.
		stringEditBoxUSBVID.FormatMessage("0x%1!X!",vid);
		stringEditBoxUSBPID.FormatMessage("0x%1!X!",pid);
		// Read ip address;
		ip = SWAP(ip_value);
		skt = (USHORT)valEditBoxSocket;
		UpdateData(FALSE);
		
		if(mBootLoader.GetPortOpenStatus(PortSelected))
		{
			// com port already opened. close com port
			mBootLoader.ClosePort(PortSelected);			
		}
		// Open Communication port freshly.
		mBootLoader.OpenPort(PortSelected, comport, baud, vid, pid, skt, ip, GetSafeHwnd());
        
		
		if(mBootLoader.GetPortOpenStatus(PortSelected))
		{	// COM port opened.
			// Shut down the rx-tx thread, if already opened.
			mBootLoader.ShutdownThread();
			// Create a new thread to do Rx Tx in the back ground.			
			mBootLoader.CreateRxTxThread(GetSafeHwnd()); // Create Rx Tx thread.
			// Trigger Read boot info command
			mBootLoader.SendCommand(READ_BOOT_INFO, 30, 200);					
			
			// Start timer to handle GUI updates.
			SetTimer(BOOTLOADER_GUI_UPDATE_TIMER, 300, NULL);  // Timer elapses every 300 ms.

			// Print a message to user/
			PrintKonsole("Please reset device and invoke bootloader");
			// Save button status.
			SaveButtonStatus();
			// Disable all buttons to avoid further operations
			EnableAllButtons(false);
		}

		
	}
}

/****************************************************************************
 * Invoked just after dialog is created. Do some extra initialization
 * like enabling and disabling buttons and so on.
 *  
 *****************************************************************************/
void CPIC32UBLDlg::ExtraInitialization()
{
	char com[9][5] = { "COM1", "COM2", "COM3", "COM4", "COM5", "COM6", "COM7", "COM8", "COM9"};
	char baud[5][10] = {"9600", "19200", "38400", "57600", "115200"};

	EraseProgVer = false;

	// Fill Com Port Combo Box with "COM1, COM2 ........, COM9"	
	for(int i = 8; i >= 0; i--)
	{
		ctrlComboBoxComPort.InsertString(0, com[i]);
	}

	// By default set "COM1" in com port combo box 
	ctrlComboBoxComPort.SetCurSel(0);

	

	// Fill Baud Rate Combo Box with "9600, 19200, 38400, 57600, 115200"
	for(i = 4; i >= 0; i--)
	{
		ctrlComboBoxBaudRate.InsertString(0, baud[i]);
	}
	// By default set "115200" in baud rate combo box
	ctrlComboBoxBaudRate.SetCurSel(4);
	

	// Mask all buttons, except for "Connect Device"
	EnableAllButtons(false);
	ctrlButtonConnectDevice.EnableWindow(true);

	// Mark this flag as false.
	ConnectionEstablished = false;

	// Display default VID and PID in edit box. This is default value for Microchip device to work.
	stringEditBoxUSBVID = "0x4D8";
	stringEditBoxUSBPID = "0x03C";
	// Select communication "Com Port" by default.
	 boolCheckComEnable = 1;
	PortSelected = COM;
	// Diasble serial port selection and baud rate selection.
	ctrlComboBoxBaudRate.EnableWindow(TRUE);
	ctrlComboBoxComPort.EnableWindow(TRUE);
	// Enable USB VID and PID edit boxes.
	ctrlEditBoxUSBVID.EnableWindow(FALSE);
	ctrlEditBoxUSBPID.EnableWindow(FALSE);
	// Enable IP Address and Socket 
	ctrlEditBoxIPaddress.EnableWindow(FALSE);
	ctrlEditBoxSocketaddress.EnableWindow(FALSE);


	
	// Set default IP address to 192.168.1.11
	ip_value = inet_addr("192.168.1.11");
	ip_value = SWAP(ip_value);
	valEditBoxSocket = 6234;
	UpdateData(FALSE);

	

}

/****************************************************************************
 * Just do some mundane things here, like getting progress bar status, 
	disabling buttons if connection cuts.
   This function is called everytime the timer elapses.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnTimer(UINT nIDEvent)
{
	int Lower;
	int Upper;

	if(nIDEvent == BOOTLOADER_GUI_UPDATE_TIMER)
	{
		// Update progress bar.
		mBootLoader.GetProgress(&Lower, &Upper);
		ctrlProgressBar.SetRange( 0, Upper );
		ctrlProgressBar.SetPos(Lower);		
	}

	
	
	CDialog::OnTimer(nIDEvent);
}

/****************************************************************************
 * Invoked when button erase is clicked.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedButtonErase()
{
	SaveButtonStatus();
	// Disable all buttons, to avoid further operation.
	EnableAllButtons(false);
	mBootLoader.SendCommand(ERASE_FLASH, 3, 5000); //5s retry delay, becuse erase takes considerable time.
}


/****************************************************************************
 * Enables all button, if the parameter passed is true.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::EnableAllButtons(bool enbl)
{
	// Mask all buttons, except for "Connect Device"
	ctrlButtonProgram.EnableWindow(enbl);
	ctrlButtonLoadHex.EnableWindow(enbl);
	ctrlButtonErase.EnableWindow(enbl);
	ctrlButtonVerify.EnableWindow(enbl);
	ctrlButtonRunApplication.EnableWindow(enbl);
//	ctrlButtonConnectDevice.EnableWindow(enbl);
	ctrlButtonEraseProgVerify.EnableWindow(enbl);
	ctrlButtonBootloaderVer.EnableWindow(enbl);

