DangerousPrototypes/dangerous-prototypes-open-hardware/trunk/Logic_Pirate/AN1388_Source_Code_V2012_10_05/PIC32_Bootloaders/PC Application/PIC32UBL/PIC32UBLDlg.cpp
}


/****************************************************************************
 * Invoked when load hex button is clicked.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedButtonLoadhex()
{
	CString string;
	// Save button status.
	SaveButtonStatus();
	if(mBootLoader.LoadHexFile())
	{
		PrintKonsole("Hex file loaded successfully");
		// Enable Program button
		ctrlButtonProgram.EnableWindow(true);
		ctrlButtonEraseProgVerify.EnableWindow(true);
	}
	else
	{
		PrintKonsole("Hex file loading failed");
	}	
}


/****************************************************************************
 * This function is invoked when there is a response from the device.
 Process the response based on the command.
 * 
 *  
 *****************************************************************************/
LRESULT CPIC32UBLDlg::OnReceiveResponse(WPARAM cmd, LPARAM RxDataPtrAdrs)
{
	char MajorVer;// = RxData[3];
	char MinorVer ;//= RxData[4];
	char *RxData;
	CString string;
	unsigned short crc;

	RxData = (char *)RxDataPtrAdrs;
	MajorVer = RxData[0];
	MinorVer = RxData[1];

	switch(cmd)
	{
	case READ_BOOT_INFO:
		if(ConnectionEstablished == false)
		{
			// New connection.
			ClearKonsole();
			string.FormatMessage("Device connected"); 
			PrintKonsole(string);
		}
		string.FormatMessage("Bootloader Firmware Version: %1!d!.%2!d!", MajorVer, MinorVer);
		PrintKonsole(string);		
		// Enable only load hex, Disconnect and erase buttons for next operation.
		ctrlButtonLoadHex.EnableWindow(true);
		ctrlButtonErase.EnableWindow(true);
		// Change the connect button to disconnect.
		ConnectionEstablished = true;
		ctrlButtonConnectDevice.SetWindowText("Disconnect");
		// Disable baud rate and com port combo boxes.
		ctrlComboBoxBaudRate.EnableWindow(false);
		ctrlComboBoxComPort.EnableWindow(false);
		// Disable USB VID and PID boxes.
		ctrlEditBoxUSBVID.EnableWindow(false);
		ctrlEditBoxUSBPID.EnableWindow(false);

		// Also enable bootloader version info.
		ctrlButtonBootloaderVer.EnableWindow(true);
		break;

	case ERASE_FLASH:
		PrintKonsole("Flash Erased");
		if(EraseProgVer)// Operation Erase->Program->Verify
		{
			// Erase completed. Next operation is programming.
			mBootLoader.SendCommand(PROGRAM_FLASH, 3, 500); // 500ms delay	
		}
		// Restore button status to allow further operations.
		RestoreButtonStatus();
		break;

	case PROGRAM_FLASH:
		PrintKonsole("Programming completed");
		// Restore button status to allow further operations.
		RestoreButtonStatus();
		ctrlButtonVerify.EnableWindow(true);
		ctrlButtonRunApplication.EnableWindow(true);

		if(EraseProgVer)// Operation Erase->Program->Verify
		{
			// Programming completed. Next operation is verification.
			mBootLoader.SendCommand(READ_CRC, 3, 5000);// 5 second delay
		}
		break;

	case READ_CRC:
		crc = ((RxData[1] << 8) & 0xFF00) | (RxData[0] & 0x00FF);
		
		if(crc == mBootLoader.CalculateFlashCRC())
		{
			PrintKonsole("Verification successfull");
		}
		else
		{
			PrintKonsole("Verification failed");
		}
		// Reset erase->program-verify operation.
		EraseProgVer = false;
		// Restore button status to allow further operations.
		RestoreButtonStatus();
		ctrlButtonVerify.EnableWindow(true);
		ctrlButtonRunApplication.EnableWindow(true);
		break;
	}
	
	if(!ConnectionEstablished)
	{
		// Disable all buttons, if disconnected.
		EnableAllButtons(false);
	}
	return 1;
}


/****************************************************************************
 *  This function is invoked when there is no resonse from the device, even after
	retries.
 *  
 *****************************************************************************/
LRESULT CPIC32UBLDlg::OnTransmitFailure(WPARAM cmd, LPARAM)
{
	CString string;
	
	EraseProgVer = false;
	switch(cmd)
	{
	case READ_BOOT_INFO:		
	case ERASE_FLASH:
	case PROGRAM_FLASH:
	case READ_CRC:
		PrintKonsole("No Response from the device. Operation failed");
		RestoreButtonStatus();
		break;
	}

	if(!ConnectionEstablished)
	{
		// Disable all buttons, if disconnected.
		EnableAllButtons(false);
	}

	return 1;
}


/****************************************************************************
 * Invoked when the button program is clicked.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedButtonProgram()
{
	// Save button status.
	SaveButtonStatus();
	// Disable all buttons to avoid further operations
	EnableAllButtons(false);
	mBootLoader.SendCommand(PROGRAM_FLASH, 3, 5000); // 500ms delay
		
}


/****************************************************************************
 * This function is invoked when button verify is clicked
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedButtonVerify()
{
	// Save button status.
	SaveButtonStatus();
	// Disable all buttons to avoid further operations
	EnableAllButtons(false);
	mBootLoader.SendCommand(READ_CRC, 3, 5000);
}


/****************************************************************************
 * This function is invoked when button Erase-Program-Verify is clicked
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedButtonEraseProgVerify()
{
	// TODO: Add your control notification handler code here
	// Save button status.
	SaveButtonStatus();
	// Disable all buttons to avoid further operations
	EnableAllButtons(false);

	EraseProgVer = true;
	// Start with erase. Rest is automatically handled by state machine.
	mBootLoader.SendCommand(ERASE_FLASH, 3, 5000); // 5s delay

}


/****************************************************************************
 * This function is invoked when button run application is clicked
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedButtonRunapplication()
{
	CString string;

