DangerousPrototypes/dangerous-prototypes-open-hardware/trunk/Logic_Pirate/AN1388_Source_Code_V2012_10_05/PIC32_Bootloaders/PC Application/PIC32UBL/PIC32UBLDlg.cpp
	mBootLoader.SendCommand(JMP_TO_APP, 1, 10); // 10ms delay
	PrintKonsole("\nCommand issued to run application");
}

/****************************************************************************
 * This function is invoked when button Read Version is clicked
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedButtonBootVer()
{
	// TODO: Add your control notification handler code here
	// Save button status.
	SaveButtonStatus();
	// Disable all buttons to avoid further operations
	EnableAllButtons(false);
	mBootLoader.SendCommand(READ_BOOT_INFO, 50, 200);
}


/****************************************************************************
 * Print Konsole
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::PrintKonsole(CString string)
{

	cstringEditConsole += string;
	string.FormatMessage("\n");
	cstringEditConsole += string;
	UpdateData(false);
	// Set the console window vertical scroll to the end.
	ctrlEditConsole.SetSel(32767, 32767);
}

/****************************************************************************
 * Clears konsole
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::ClearKonsole(void)
{

	cstringEditConsole = "";
	
	UpdateData(false);
	// Set the console window vertical scroll to the end.
	ctrlEditConsole.SetSel(32767, 32767);
}


/****************************************************************************
 * Saves the current status of the button and restores the button
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::ButtonStatus(unsigned int oprn)
{
	static unsigned int status;
	

	if(oprn == SAVE)
	{
		(ctrlButtonProgram.IsWindowEnabled())? status |= 0x01: status &= ~0x01;
		(ctrlButtonLoadHex.IsWindowEnabled())? status |= 0x02: status &= ~0x02;
		(ctrlButtonErase.IsWindowEnabled())? status |= 0x04: status &= ~0x04;
		(ctrlButtonVerify.IsWindowEnabled())? status |= 0x08: status &= ~0x08;
		(ctrlButtonRunApplication.IsWindowEnabled())? status |= 0x10: status &= ~0x10;
		(ctrlButtonConnectDevice.IsWindowEnabled())? status |= 0x20: status &= ~0x20;
		(ctrlButtonEraseProgVerify.IsWindowEnabled())? status |= 0x40: status &= ~0x40;
		(ctrlButtonBootloaderVer.IsWindowEnabled())? status |= 0x80: status &= ~0x80;
	}
	else
	{
		// Restore
		(status & 0x01)? ctrlButtonProgram.EnableWindow(true): ctrlButtonProgram.EnableWindow(false);
		(status & 0x02)? ctrlButtonLoadHex.EnableWindow(true): ctrlButtonLoadHex.EnableWindow(false);
		(status & 0x04)? ctrlButtonErase.EnableWindow(true): ctrlButtonErase.EnableWindow(false);
		(status & 0x08)? ctrlButtonVerify.EnableWindow(true): ctrlButtonVerify.EnableWindow(false);
		(status & 0x10)? ctrlButtonRunApplication.EnableWindow(true): ctrlButtonRunApplication.EnableWindow(false);
		(status & 0x20)? ctrlButtonConnectDevice.EnableWindow(true): ctrlButtonConnectDevice.EnableWindow(false);
		(status & 0x40)? ctrlButtonEraseProgVerify.EnableWindow(true): ctrlButtonEraseProgVerify.EnableWindow(false);
		(status & 0x80)? ctrlButtonBootloaderVer.EnableWindow(true): ctrlButtonBootloaderVer.EnableWindow(false);
	}


}


/****************************************************************************
 * COM check box button clicked.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedCheckComEnable()
{
	// TODO: Add your control notification handler code here
	UpdateData(TRUE);
	boolCheckComEnable = 1;
	boolCheckUsbEnable = 0;	
	boolCheckEthEnable = 0;
	PortSelected = COM;

	// Enable serial port selection and baud rate selection.
	ctrlComboBoxBaudRate.EnableWindow(TRUE);
	ctrlComboBoxComPort.EnableWindow(TRUE);
	// Disable USB VID and PID edit boxes.
	ctrlEditBoxUSBVID.EnableWindow(FALSE);
	ctrlEditBoxUSBPID.EnableWindow(FALSE);
	// Disable IP Address and Socket 
	ctrlEditBoxIPaddress.EnableWindow(FALSE);
	ctrlEditBoxSocketaddress.EnableWindow(FALSE);


	UpdateData(FALSE);
}


/****************************************************************************
 * USB check box button clicked.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedCheckUsbEnable()
{
	// TODO: Add your control notification handler code here
	UpdateData(TRUE);
	boolCheckUsbEnable = 1;
	boolCheckComEnable = 0;
	boolCheckEthEnable = 0;
	PortSelected = USB;

	// Diasble serial port selection and baud rate selection.
	ctrlComboBoxBaudRate.EnableWindow(FALSE);
	ctrlComboBoxComPort.EnableWindow(FALSE);
	// Enable USB VID and PID edit boxes.
	ctrlEditBoxUSBVID.EnableWindow(TRUE);
	ctrlEditBoxUSBPID.EnableWindow(TRUE);
	// Enable IP Address and Socket 
	ctrlEditBoxIPaddress.EnableWindow(FALSE);
	ctrlEditBoxSocketaddress.EnableWindow(FALSE);


	UpdateData(FALSE);
}


/****************************************************************************
 * Ethernet check box button clicked.
 * 
 *  
 *****************************************************************************/
void CPIC32UBLDlg::OnBnClickedCheckEthEnable()
{
	// TODO: Add your control notification handler code here
	UpdateData(TRUE);
	boolCheckEthEnable = 1;
	boolCheckComEnable = 0;
	boolCheckUsbEnable = 0;
	PortSelected = ETH;

	// Diasble serial port selection and baud rate selection.
	ctrlComboBoxBaudRate.EnableWindow(FALSE);
	ctrlComboBoxComPort.EnableWindow(FALSE);
	// Enable USB VID and PID edit boxes.
	ctrlEditBoxUSBVID.EnableWindow(FALSE);
	ctrlEditBoxUSBPID.EnableWindow(FALSE);
	// Enable IP Address and Socket 
	ctrlEditBoxIPaddress.EnableWindow(TRUE);
	ctrlEditBoxSocketaddress.EnableWindow(TRUE);

	UpdateData(FALSE);
}



BOOL CPIC32UBLDlg::OnDeviceChange(UINT wParam, DWORD lParam)
{
	UINT k = 0;
	DEV_BROADCAST_DEVICEINTERFACE *pdevBroadCastHdr;

	if(lParam != 0)
	{
		pdevBroadCastHdr = (DEV_BROADCAST_DEVICEINTERFACE *)lParam;

		if(pdevBroadCastHdr->dbcc_devicetype == DBT_DEVTYP_DEVICEINTERFACE)
		{
			switch(wParam)
			{
				case DBT_DEVICEARRIVAL:					
					return TRUE;
				case DBT_DEVICEREMOVECOMPLETE:
				case DBT_DEVICEQUERYREMOVE:
				case DBT_DEVICEQUERYREMOVEFAILED:
				case DBT_DEVICEREMOVEPENDING:
				case DBT_DEVICETYPESPECIFIC:
					if(mBootLoader.NotifyDeviceChange(PortSelected, pdevBroadCastHdr->dbcc_name))
					{
						OnBnClickedButtonConnect();
					}
					return TRUE;
				default:
					return TRUE;
			}
		}
	}

	return TRUE;
}
/********************************End of file**********************************/
void CPIC32UBLDlg::OnDevModeChange(LPTSTR lpDeviceName)
{
	CDialog::OnDevModeChange(lpDeviceName);

	// TODO: Add your message handler code here
}
